nlbutts/LaserBodyRoll/Software/IOBoard.cydsn/Generated_Source/PSoC4/VDAC_2_UAB_regs.h
/*check results of mapping
1. All vin mapped
2. x0,x1,x2, and x3 are in range of 0 to 3
3. x0,x1,x2, and x3 are unique
*/
#if !( (VDAC_2_UAB__X4_FLAGS==0xF) && \
    ( (0<=VDAC_2_UAB_X0) && (VDAC_2_UAB_X0<=3) ) && \
    ( (0<=VDAC_2_UAB_X1) && (VDAC_2_UAB_X1<=3) ) && \
    ( (0<=VDAC_2_UAB_X2) && (VDAC_2_UAB_X2<=3) ) && \
    ( (0<=VDAC_2_UAB_X3) && (VDAC_2_UAB_X3<=3) ) && \
    (VDAC_2_UAB_X0!=VDAC_2_UAB_X1) && \
    (VDAC_2_UAB_X1!=VDAC_2_UAB_X2) && \
    (VDAC_2_UAB_X2!=VDAC_2_UAB_X3) )
#error "bad x input to vin mapping"
#endif

#define VDAC_2_UAB_XIN_COUNT 4UL



/* UAB half shared switch assymmetry special cases */
#define VDAC_2_UAB_AGND_TIED_ADDR (VDAC_2_UAB_halfuab__AGND_TIED)
#define VDAC_2_UAB_AGND_TIED_PTR  ((reg32*)VDAC_2_UAB_AGND_TIED_ADDR)
#define VDAC_2_UAB_AGND_TIED_REG  (*(VDAC_2_UAB_AGND_TIED_PTR))

#define VDAC_2_UAB_REF_TIED_PTR  ((reg32*)VDAC_2_UAB_halfuab__REF_TIED)
#define VDAC_2_UAB_REF_TIED_REG  (*(VDAC_2_UAB_REF_TIED_PTR))

#define VDAC_2_UAB_SW_AA_PTR     ((reg32*)VDAC_2_UAB_halfuab__SW_AA)
#define VDAC_2_UAB_SW_AA_REG     (*(VDAC_2_UAB_SW_AA_PTR))

#define VDAC_2_UAB_SW_BB_PTR     ((reg32*)VDAC_2_UAB_halfuab__SW_BB)
#define VDAC_2_UAB_SW_BB_REG     (*(VDAC_2_UAB_SW_BB_PTR))

#define VDAC_2_UAB_SW_CC_ADDR     (VDAC_2_UAB_halfuab__SW_CC)
#define VDAC_2_UAB_SW_CC_PTR     ((reg32*)VDAC_2_UAB_SW_CC_ADDR)
#define VDAC_2_UAB_SW_CC_REG     (*(VDAC_2_UAB_SW_CC_PTR))

#define VDAC_2_UAB_ISPAIRED      (VDAC_2_UAB_halfuab__ISPAIRED)

#define VDAC_2_UAB_UAB_CTRL_ADDR                 (VDAC_2_UAB_halfuab__UAB_CTRL)
#define VDAC_2_UAB_UAB_CTRL_PTR                 ((reg32*)VDAC_2_UAB_UAB_CTRL_ADDR)
#define VDAC_2_UAB_UAB_CTRL_REG                 (*(VDAC_2_UAB_UAB_CTRL_PTR))

#define VDAC_2_UAB_INTR_ADDR                     (VDAC_2_UAB_halfuab__INTR)
#define VDAC_2_UAB_INTR_PTR                     ((reg32*)VDAC_2_UAB_INTR_ADDR)
#define VDAC_2_UAB_INTR_REG                     (*(VDAC_2_UAB_INTR_PTR))

#define VDAC_2_UAB_INTR_SET_ADDR                 (VDAC_2_UAB_halfuab__INTR_SET)
#define VDAC_2_UAB_INTR_SET_PTR                 ((reg32*)VDAC_2_UAB_INTR_SET_ADDR)
#define VDAC_2_UAB_INTR_SET_REG                 (*(VDAC_2_UAB_INTR_SET_PTR))

#define VDAC_2_UAB_INTR_MASK_ADDR                (VDAC_2_UAB_halfuab__INTR_MASK)
#define VDAC_2_UAB_INTR_MASK_PTR                ((reg32*)VDAC_2_UAB_INTR_MASK_ADDR)
#define VDAC_2_UAB_INTR_MASK_REG                (*(VDAC_2_UAB_INTR_MASK_PTR))

#define VDAC_2_UAB_INTR_MASKED_ADDR              (VDAC_2_UAB_halfuab__INTR_MASKED)
#define VDAC_2_UAB_INTR_MASKED_PTR              ((reg32*)VDAC_2_UAB_INTR_MASKED_ADDR)
#define VDAC_2_UAB_INTR_MASKED_REG              (*(VDAC_2_UAB_INTR_MASKED_PTR))

#define VDAC_2_UAB_OA_CTRL_ADDR                  (VDAC_2_UAB_halfuab__OA_CTRL)
#define VDAC_2_UAB_OA_CTRL_PTR                  ((reg32*)VDAC_2_UAB_OA_CTRL_ADDR)
#define VDAC_2_UAB_OA_CTRL_REG                  (*(VDAC_2_UAB_OA_CTRL_PTR))

#define VDAC_2_UAB_CAP_CTRL_ADDR                 (VDAC_2_UAB_halfuab__CAP_CTRL)
#define VDAC_2_UAB_CAP_CTRL_PTR                 ((reg32*)VDAC_2_UAB_CAP_CTRL_ADDR)
#define VDAC_2_UAB_CAP_CTRL_REG                 (*(VDAC_2_UAB_CAP_CTRL_PTR))

#define VDAC_2_UAB_CAP_ABCF_VAL_ADDR             (VDAC_2_UAB_halfuab__CAP_ABCF_VAL)
#define VDAC_2_UAB_CAP_ABCF_VAL_PTR             ((reg32*)VDAC_2_UAB_CAP_ABCF_VAL_ADDR)
#define VDAC_2_UAB_CAP_ABCF_VAL_REG             (*(VDAC_2_UAB_CAP_ABCF_VAL_PTR))

#define VDAC_2_UAB_CAP_AB_VAL_NXT_ADDR           (VDAC_2_UAB_halfuab__CAP_AB_VAL_NXT)
#define VDAC_2_UAB_CAP_AB_VAL_NXT_PTR           ((reg32*)VDAC_2_UAB_CAP_AB_VAL_NXT_ADDR)
#define VDAC_2_UAB_CAP_AB_VAL_NXT_REG           (*(VDAC_2_UAB_CAP_AB_VAL_NXT_PTR))

#define VDAC_2_UAB_CAP_CF_VAL_NXT_ADDR           (VDAC_2_UAB_halfuab__CAP_CF_VAL_NXT)
#define VDAC_2_UAB_CAP_CF_VAL_NXT_PTR           ((reg32*)VDAC_2_UAB_CAP_CF_VAL_NXT_ADDR)
#define VDAC_2_UAB_CAP_CF_VAL_NXT_REG           (*(VDAC_2_UAB_CAP_CF_VAL_NXT_PTR))

#define VDAC_2_UAB_STARTUP_DELAY_ADDR            (VDAC_2_UAB_halfuab__STARTUP_DELAY)
#define VDAC_2_UAB_STARTUP_DELAY_PTR            ((reg32*)VDAC_2_UAB_STARTUP_DELAY_ADDR)
#define VDAC_2_UAB_STARTUP_DELAY_REG            (*(VDAC_2_UAB_STARTUP_DELAY_PTR))

#define VDAC_2_UAB_SUBSAMPLE_CTRL_ADDR           (VDAC_2_UAB_halfuab__SUBSAMPLE_CTRL)
#define VDAC_2_UAB_SUBSAMPLE_CTRL_PTR           ((reg32*)VDAC_2_UAB_SUBSAMPLE_CTRL_ADDR)
#define VDAC_2_UAB_SUBSAMPLE_CTRL_REG           (*(VDAC_2_UAB_SUBSAMPLE_CTRL_PTR))

#define VDAC_2_UAB_SW_STATIC_ADDR               (VDAC_2_UAB_halfuab__SW_STATIC )
#define VDAC_2_UAB_SW_STATIC_PTR                ((reg32*)VDAC_2_UAB_SW_STATIC_ADDR)
#define VDAC_2_UAB_SW_STATIC_REG                (*(VDAC_2_UAB_SW_STATIC_PTR))

#define VDAC_2_UAB_SW_MODBIT_SRC_ADDR            (VDAC_2_UAB_halfuab__SW_MODBIT_SRC)
#define VDAC_2_UAB_SW_MODBIT_SRC_PTR            ((reg32*)VDAC_2_UAB_SW_MODBIT_SRC_ADDR)
#define VDAC_2_UAB_SW_MODBIT_SRC_REG            (*(VDAC_2_UAB_SW_MODBIT_SRC_PTR))

#define VDAC_2_UAB_SW_CA_IN0_ADDR                (VDAC_2_UAB_halfuab__SW_CA_IN0)
#define VDAC_2_UAB_SW_CA_IN0_PTR                ((reg32*)VDAC_2_UAB_SW_CA_IN0_ADDR)
#define VDAC_2_UAB_SW_CA_IN0_REG                (*(VDAC_2_UAB_SW_CA_IN0_PTR))

#define VDAC_2_UAB_SW_CA_IN1_ADDR                (VDAC_2_UAB_halfuab__SW_CA_IN1)
#define VDAC_2_UAB_SW_CA_IN1_PTR                ((reg32*)VDAC_2_UAB_SW_CA_IN1_ADDR)
#define VDAC_2_UAB_SW_CA_IN1_REG                (*(VDAC_2_UAB_SW_CA_IN1_PTR))

#define VDAC_2_UAB_SW_CA_TOP_ADDR                (VDAC_2_UAB_halfuab__SW_CA_TOP)
#define VDAC_2_UAB_SW_CA_TOP_PTR                ((reg32*)VDAC_2_UAB_SW_CA_TOP_ADDR)
#define VDAC_2_UAB_SW_CA_TOP_REG                (*(VDAC_2_UAB_SW_CA_TOP_PTR))

#define VDAC_2_UAB_SW_CB_IN0_ADDR                (VDAC_2_UAB_halfuab__SW_CB_IN0)
#define VDAC_2_UAB_SW_CB_IN0_PTR                ((reg32*)VDAC_2_UAB_SW_CB_IN0_ADDR)
#define VDAC_2_UAB_SW_CB_IN0_REG                (*(VDAC_2_UAB_SW_CB_IN0_PTR))

#define VDAC_2_UAB_SW_CB_IN1_ADDR                (VDAC_2_UAB_halfuab__SW_CB_IN1)
#define VDAC_2_UAB_SW_CB_IN1_PTR                ((reg32*)VDAC_2_UAB_SW_CB_IN1_ADDR)
#define VDAC_2_UAB_SW_CB_IN1_REG                (*(VDAC_2_UAB_SW_CB_IN1_PTR))

#define VDAC_2_UAB_SW_CB_TOP_ADDR                (VDAC_2_UAB_halfuab__SW_CB_TOP)
#define VDAC_2_UAB_SW_CB_TOP_PTR                ((reg32*)VDAC_2_UAB_SW_CB_TOP_ADDR)
#define VDAC_2_UAB_SW_CB_TOP_REG                (*(VDAC_2_UAB_SW_CB_TOP_PTR))

