nlbutts/LaserBodyRoll/Software/IOBoard.cydsn/Generated_Source/PSoC4/VDAC_2_UAB_regs.h
/*INTR_MASKED*/
#define VDAC_2_UAB_INTR_COMP_MASKED_SHIFT       VDAC_2_UAB_INTR_COMP_SHIFT
#define VDAC_2_UAB_INTR_COMP_MASKED_MASK        (1UL<<VDAC_2_UAB_INTR_COMP_MASKED_SHIFT)

#define VDAC_2_UAB_INTR_VDAC_EMPTY_MASKED_SHIFT VDAC_2_UAB_INTR_VDAC_EMPTY_SHIFT
#define VDAC_2_UAB_INTR_VDAC_EMPTY_MASKED_MASK  (1UL<<VDAC_2_UAB_INTR_VDAC_EMPTY_MASKED_SHIFT)


/*OA_CTRL*/
#define VDAC_2_UAB_OA_PWR_SHIFT                 CyUAB_OA_PWR_SHIFT
#define VDAC_2_UAB_OA_PWR_MASK                  (0x7UL<<VDAC_2_UAB_OA_PWR_SHIFT)

#define VDAC_2_UAB_CMP_PWR_SHIFT                CyUAB_CMP_PWR_SHIFT
#define VDAC_2_UAB_CMP_PWR_MASK                 (0x7UL<<VDAC_2_UAB_CMP_PWR_SHIFT)

#define VDAC_2_UAB_CMP_EDGE_SHIFT               CyUAB_CMP_EDGE_SHIFT
#define VDAC_2_UAB_CMP_EDGE_MASK                (0x3UL<<VDAC_2_UAB_CMP_EDGE_SHIFT)
#define VDAC_2_UAB_CMP_EDGE_DISABLE             (0UL)
#define VDAC_2_UAB_CMP_EDGE_RISING              (1UL)
#define VDAC_2_UAB_CMP_EDGE_FALLING             (2UL)
#define VDAC_2_UAB_CMP_EDGE_BOTH                (3UL)

#define VDAC_2_UAB_CMP_DSI_LEVEL_SHIFT          CyUAB_CMP_DSI_LEVEL_SHIFT
#define VDAC_2_UAB_CMP_DSI_LEVEL_MASK           (1UL<<VDAC_2_UAB_CMP_DSI_LEVEL_SHIFT)

#define VDAC_2_UAB_CTRL_SPARE_SHIFT             CyUAB_CTRL_SPARE_SHIFT
#define VDAC_2_UAB_CTRL_SPARE_MASK              (1UL<<VDAC_2_UAB_CTRL_SPARE_SHIFT)

#define VDAC_2_UAB_REF_PWR_SHIFT                CyUAB_REF_PWR_SHIFT
#define VDAC_2_UAB_REF_PWR_MASK                 (0x7UL<<VDAC_2_UAB_REF_PWR_SHIFT)

#define VDAC_2_UAB_REF_PTS_SHIFT                CyUAB_REF_PTS_SHIFT
#define VDAC_2_UAB_REF_PTS_MASK                 (1UL<<VDAC_2_UAB_REF_PTS_SHIFT)

#define VDAC_2_UAB_AGND_PWR_SHIFT               CyUAB_AGND_PWR_SHIFT
#define VDAC_2_UAB_AGND_PWR_MASK                (0x7UL<<VDAC_2_UAB_AGND_PWR_SHIFT)

#define VDAC_2_UAB_AGND_PTS_SHIFT               CyUAB_AGND_PTS_SHIFT
#define VDAC_2_UAB_AGND_PTS_MASK                (1UL<<VDAC_2_UAB_AGND_PTS_SHIFT)

#define VDAC_2_UAB_AGND_TIED_SHIFT              CyUAB_AGND_TIED_SHIFT
#define VDAC_2_UAB_AGND_TIED_MASK               (1UL<<VDAC_2_UAB_AGND_TIED_SHIFT)

#define VDAC_2_UAB_REF_TIED_SHIFT               CyUAB_REF_TIED_SHIFT
#define VDAC_2_UAB_REF_TIED_MASK                (1UL<<VDAC_2_UAB_REF_TIED_SHIFT)    
    
#define VDAC_2_UAB_UAB_PWR_SHIFT                CyUAB_UAB_PWR_SHIFT
#define VDAC_2_UAB_UAB_PWR_MASK                 (0x3UL<<VDAC_2_UAB_UAB_PWR_SHIFT)
#define VDAC_2_UAB_UAB_PWR_NORMAL               (0UL)
#define VDAC_2_UAB_UAB_PWR_ULTRA_LOW            (1UL)
#define VDAC_2_UAB_UAB_PWR_ULTRA_HIGH           (2UL)
#define VDAC_2_UAB_UAB_PWR_Reserved             (3UL)


/*CAP_CTRL*/
#define VDAC_2_UAB_CB_GND_SHIFT                 CyUAB_CB_GND_SHIFT
#define VDAC_2_UAB_CB_GND_MASK                  (1UL<<VDAC_2_UAB_CB_GND_SHIFT)

#define VDAC_2_UAB_CC_GND_SHIFT                 CyUAB_CC_GND_SHIFT
#define VDAC_2_UAB_CC_GND_MASK                  (1UL<<VDAC_2_UAB_CC_GND_SHIFT)

#define VDAC_2_UAB_FRC_SIGN_BIT_SHIFT           CyUAB_FRC_SIGN_BIT_SHIFT
#define VDAC_2_UAB_FRC_SIGN_BIT_MASK            (1UL<<CyUAB_FRC_SIGN_BIT_SHIFT)

#define VDAC_2_UAB_DAC_MODE_EN_SHIFT            CyUAB_DAC_MODE_EN_SHIFT
#define VDAC_2_UAB_DAC_MODE_EN_MASK             (1UL<<VDAC_2_UAB_DAC_MODE_EN_SHIFT)

#define VDAC_2_UAB_DAC_MODE_SHIFT               CyUAB_DAC_MODE_SHIFT
#define VDAC_2_UAB_DAC_MODE_MASK                (0x3UL<<VDAC_2_UAB_DAC_MODE_SHIFT)
#define VDAC_2_UAB_DAC_MODE_UNSIGNED12          (0UL)
#define VDAC_2_UAB_DAC_MODE_VIRT_SIGNED12       (1UL)
#define VDAC_2_UAB_DAC_MODE_SIGNED13            (2UL)
#define VDAC_2_UAB_DAC_MODE_RESERVED            (3UL)


/*CAP_ABCF_VAL, CAP_AB_VAL_NXT, and CAP_CF_VAL_NXT*/
#define VDAC_2_UAB_CB_VAL_SHIFT                 CyUAB_CB_VAL_SHIFT
#define VDAC_2_UAB_CB_VAL_MASK                  (0x3fUL<<VDAC_2_UAB_CB_VAL_SHIFT)

#define VDAC_2_UAB_CA_VAL_SHIFT                 CyUAB_CA_VAL_SHIFT
#define VDAC_2_UAB_CA_VAL_MASK                  (0x3fUL<<VDAC_2_UAB_CA_VAL_SHIFT)

#define VDAC_2_UAB_SIGN_VAL_SHIFT               CyUAB_SIGN_VAL_SHIFT
#define VDAC_2_UAB_SIGN_VAL_MASK                (1UL<<VDAC_2_UAB_SIGN_VAL_SHIFT)

#define VDAC_2_UAB_CB_64_SHIFT                  CyUAB_CB_64_SHIFT
#define VDAC_2_UAB_CB_64_MASK                   (1UL<<VDAC_2_UAB_CB_64_SHIFT)

#define VDAC_2_UAB_CC_VAL_SHIFT                 CyUAB_CC_VAL_SHIFT
#define VDAC_2_UAB_CC_VAL_MASK                  (0x3fUL<<VDAC_2_UAB_CC_VAL_SHIFT)

#define VDAC_2_UAB_CF_VAL_SHIFT                 CyUAB_CF_VAL_SHIFT
#define VDAC_2_UAB_CF_VAL_MASK                  (0x1fUL<<VDAC_2_UAB_CF_VAL_SHIFT)


/*CAP_CF_VAL_NXT*/
#define VDAC_2_UAB_CC_VAL_UPDATE_SHIFT          CyUAB_CC_VAL_UPDATE_SHIFT
#define VDAC_2_UAB_CC_VAL_UPDATE_MASK           (1UL<<VDAC_2_UAB_CC_VAL_UPDATE_SHIFT)

#define VDAC_2_UAB_CF_VAL_UPDATE_SHIFT          CyUAB_CF_VAL_UPDATE_SHIFT
#define VDAC_2_UAB_CF_VAL_UPDATE_MASK           (1UL<<VDAC_2_UAB_CF_VAL_UPDATE_SHIFT)


/*STARTUP_DELAY*/
#define VDAC_2_UAB_STARTUP_DELAY_SHIFT          CyUAB_STARTUP_DELAY_SHIFT
#define VDAC_2_UAB_STARTUP_DELAY_MASK           (0x0000ffffUL)

#define VDAC_2_UAB_ALIGN_MODE_SHIFT             CyUAB_ALIGN_MODE_SHIFT
#define VDAC_2_UAB_ALIGN_MODE_MASK              (1UL<<VDAC_2_UAB_ALIGN_MODE_SHIFT)


/*SUBSAMPLE_CTRL*/
#define VDAC_2_UAB_SUBSAMPLE_SHIFT              CyUAB_SUBSAMPLE_SHIFT
#define VDAC_2_UAB_SUBSAMPLE_MASK               (0xffUL<<VDAC_2_UAB_SUBSAMPLE_SHIFT)

#define VDAC_2_UAB_SUBSAMPLE_INIT_SHIFT         CyUAB_SUBSAMPLE_INIT_SHIFT
#define VDAC_2_UAB_SUBSAMPLE_INIT_MASK          (0xffUL<<VDAC_2_UAB_SUBSAMPLE_INIT_SHIFT)


/*SW_STATIC*/
#define VDAC_2_UAB_SW_G0_SHIFT                  CyUAB_SW_G0_SHIFT
#define VDAC_2_UAB_SW_G0_MASK                   (1UL<<VDAC_2_UAB_SW_G0_SHIFT)

#define VDAC_2_UAB_SW_G1_SHIFT                  CyUAB_SW_G1_SHIFT
#define VDAC_2_UAB_SW_G1_MASK                   (1UL<<VDAC_2_UAB_SW_G1_SHIFT)

#define VDAC_2_UAB_SW_G2_SHIFT                  CyUAB_SW_G2_SHIFT
#define VDAC_2_UAB_SW_G2_MASK                   (1UL<<VDAC_2_UAB_SW_G2_SHIFT)

