nlbutts/LaserBodyRoll/Software/IOBoard.cydsn/Generated_Source/PSoC4/VDAC_2_UAB_regs.h
#define VDAC_2_UAB_SW_VB_MODBIT_SHIFT           CyUAB_SW_VB_MODBIT_SHIFT
#define VDAC_2_UAB_SW_VB_MODBIT_MASK            (0xfUL<<VDAC_2_UAB_SW_VB_MODBIT_SHIFT)

#define VDAC_2_UAB_SW_TB_SHIFT                  CyUAB_SW_TB_SHIFT
#define VDAC_2_UAB_SW_TB_MASK                   (0xfUL<<VDAC_2_UAB_SW_TB_SHIFT)

#define VDAC_2_UAB_SW_SB_SHIFT                  CyUAB_SW_SB_SHIFT
#define VDAC_2_UAB_SW_SB_MASK                   (0xfUL<<VDAC_2_UAB_SW_SB_SHIFT)


/*SW_CC_IN0*/
#define VDAC_2_UAB_SW_C0_MODBIT_SHIFT           CyUAB_SW_C0_MODBIT_SHIFT
#define VDAC_2_UAB_SW_C0_MODBIT_MASK            (0xfUL<<VDAC_2_UAB_SW_C0_MODBIT_SHIFT)

#define VDAC_2_UAB_SW_C1_MODBIT_SHIFT           CyUAB_SW_C1_MODBIT_SHIFT
#define VDAC_2_UAB_SW_C1_MODBIT_MASK            (0xfUL<<VDAC_2_UAB_SW_C1_MODBIT_SHIFT)

#define VDAC_2_UAB_SW_C2_MODBIT_SHIFT           CyUAB_SW_C2_MODBIT_SHIFT
#define VDAC_2_UAB_SW_C2_MODBIT_MASK            (0xfUL<<VDAC_2_UAB_SW_C2_MODBIT_SHIFT)

#define VDAC_2_UAB_SW_C3_MODBIT_SHIFT           CyUAB_SW_C3_MODBIT_SHIFT
#define VDAC_2_UAB_SW_C3_MODBIT_MASK            (0xfUL<<VDAC_2_UAB_SW_C3_MODBIT_SHIFT)

#define VDAC_2_UAB_SW_CP_SHIFT                  CyUAB_SW_CP_SHIFT
#define VDAC_2_UAB_SW_CP_MASK                   (0xfUL<<VDAC_2_UAB_SW_CP_SHIFT)

#define VDAC_2_UAB_SW_CQ_SHIFT                  CyUAB_SW_CQ_SHIFT
#define VDAC_2_UAB_SW_CQ_MASK                   (0xfUL<<VDAC_2_UAB_SW_CQ_SHIFT)


/*SW_CC_IN1*/
#define VDAC_2_UAB_SW_CC_SHIFT                  CyUAB_SW_CC_SHIFT
#define VDAC_2_UAB_SW_CC_MASK                   (0xfUL<<VDAC_2_UAB_SW_CC_SHIFT)

#define VDAC_2_UAB_SW_CR_MODBIT_SHIFT           CyUAB_SW_CR_MODBIT_SHIFT
#define VDAC_2_UAB_SW_CR_MODBIT_MASK            (0xfUL<<VDAC_2_UAB_SW_CR_MODBIT_SHIFT)

#define VDAC_2_UAB_SW_CG_MODBIT_SHIFT           CyUAB_SW_CG_MODBIT_SHIFT
#define VDAC_2_UAB_SW_CG_MODBIT_MASK            (0xfUL<<VDAC_2_UAB_SW_CG_MODBIT_SHIFT)

#define VDAC_2_UAB_SW_CV_MODBIT_SHIFT           CyUAB_SW_CV_MODBIT_SHIFT
#define VDAC_2_UAB_SW_CV_MODBIT_MASK            (0xfUL<<VDAC_2_UAB_SW_CV_MODBIT_SHIFT)


/*SW_CC_TOP*/
#define VDAC_2_UAB_SW_RC_MODBIT_SHIFT           CyUAB_SW_RC_MODBIT_SHIFT
#define VDAC_2_UAB_SW_RC_MODBIT_MASK            (0xfUL<<VDAC_2_UAB_SW_RC_MODBIT_SHIFT)

#define VDAC_2_UAB_SW_GC_MODBIT_SHIFT           CyUAB_SW_GC_MODBIT_SHIFT
#define VDAC_2_UAB_SW_GC_MODBIT_MASK            (0xfUL<<VDAC_2_UAB_SW_GC_MODBIT_SHIFT)

#define VDAC_2_UAB_SW_VC_MODBIT_SHIFT           CyUAB_SW_VC_MODBIT_SHIFT
#define VDAC_2_UAB_SW_VC_MODBIT_MASK            (0xfUL<<VDAC_2_UAB_SW_VC_MODBIT_SHIFT)

#define VDAC_2_UAB_SW_TC_SHIFT                  CyUAB_SW_TC_SHIFT
#define VDAC_2_UAB_SW_TC_MASK                   (0xfUL<<VDAC_2_UAB_SW_TC_SHIFT)

#define VDAC_2_UAB_SW_SC_SHIFT                  CyUAB_SW_SC_SHIFT
#define VDAC_2_UAB_SW_SC_MASK                   (0xfUL<<VDAC_2_UAB_SW_SC_SHIFT)

#define VDAC_2_UAB_SW_ZC_SHIFT                  CyUAB_SW_ZC_SHIFT
#define VDAC_2_UAB_SW_ZC_MASK                   (0xfUL<<VDAC_2_UAB_SW_ZC_SHIFT)


/*SW_CF_BOT*/
#define VDAC_2_UAB_SW_GF_SHIFT                  CyUAB_SW_GF_SHIFT
#define VDAC_2_UAB_SW_GF_MASK                   (0xfUL<<VDAC_2_UAB_SW_GF_SHIFT)

#define VDAC_2_UAB_SW_PF_SHIFT                  CyUAB_SW_PF_SHIFT
#define VDAC_2_UAB_SW_PF_MASK                   (0xfUL<<VDAC_2_UAB_SW_PF_SHIFT)

#define VDAC_2_UAB_SW_PS_SHIFT                  CyUAB_SW_PS_SHIFT
#define VDAC_2_UAB_SW_PS_MASK                   (0xfUL<<VDAC_2_UAB_SW_PS_SHIFT)

#define VDAC_2_UAB_SW_PO_SHIFT                  CyUAB_SW_PO_SHIFT
#define VDAC_2_UAB_SW_PO_MASK                   (0xfUL<<VDAC_2_UAB_SW_PO_SHIFT)


/*SW_OTHER*/
#define VDAC_2_UAB_CMP_FF_SHIFT                 CyUAB_CMP_FF_SHIFT
#define VDAC_2_UAB_CMP_FF_MASK                  (0xfUL<<VDAC_2_UAB_CMP_FF_SHIFT)

#define VDAC_2_UAB_VALID_SHIFT                  CyUAB_VALID_SHIFT
#define VDAC_2_UAB_VALID_MASK                   (0xfUL<<VDAC_2_UAB_VALID_SHIFT)

#define VDAC_2_UAB_TRIG_OUT_SHIFT               CyUAB_TRIG_OUT_SHIFT
#define VDAC_2_UAB_TRIG_OUT_MASK                (0xfUL<<VDAC_2_UAB_TRIG_OUT_SHIFT)

#define VDAC_2_UAB_STROBE_SW_SHIFT              CyUAB_STROBE_SW_SHIFT
#define VDAC_2_UAB_STROBE_SW_MASK               (0xfUL<<VDAC_2_UAB_STROBE_SW_SHIFT)

#define VDAC_2_UAB_STROBE_RST_SHIFT             CyUAB_STROBE_RST_SHIFT
#define VDAC_2_UAB_STROBE_RST_MASK              (0xfUL<<VDAC_2_UAB_STROBE_RST_SHIFT)


/*SW_BOOST_CTRL*/
#define VDAC_2_UAB_CA_BOOST_SHIFT               CyUAB_CA_BOOST_SHIFT
#define VDAC_2_UAB_CA_BOOST_MASK                (0xfUL<<VDAC_2_UAB_CA_BOOST_SHIFT)

#define VDAC_2_UAB_CB_BOOST_SHIFT               CyUAB_CB_BOOST_SHIFT
#define VDAC_2_UAB_CB_BOOST_MASK                (0xfUL<<VDAC_2_UAB_CB_BOOST_SHIFT)

#define VDAC_2_UAB_CC_BOOST_SHIFT               CyUAB_CC_BOOST_SHIFT
#define VDAC_2_UAB_CC_BOOST_MASK                (0xfUL<<VDAC_2_UAB_CC_BOOST_SHIFT)

#define VDAC_2_UAB_CF_BOOST_SHIFT               CyUAB_CF_BOOST_SHIFT
#define VDAC_2_UAB_CF_BOOST_MASK                (0xfUL<<VDAC_2_UAB_CF_BOOST_SHIFT)

#define VDAC_2_UAB_SUM_BOOST_SHIFT              CyUAB_SUM_BOOST_SHIFT
#define VDAC_2_UAB_SUM_BOOST_MASK               (0xfUL<<VDAC_2_UAB_SUM_BOOST_SHIFT)

#define VDAC_2_UAB_PUMP_WAVE_SHIFT              CyUAB_PUMP_WAVE_SHIFT
#define VDAC_2_UAB_PUMP_WAVE_MASK               (0xfUL<<VDAC_2_UAB_PUMP_WAVE_SHIFT)


/*SRAM_CTRL*/
#define VDAC_2_UAB_LAST_STEP_SHIFT              CyUAB_LAST_STEP_SHIFT
#define VDAC_2_UAB_LAST_STEP_MASK               (0xfUL<<VDAC_2_UAB_LAST_STEP_SHIFT)

#define VDAC_2_UAB_TRIG_SEL_SHIFT               CyUAB_TRIG_SEL_SHIFT
#define VDAC_2_UAB_TRIG_SEL_MASK                (0x1fUL<<VDAC_2_UAB_TRIG_SEL_SHIFT)

#define VDAC_2_UAB_TRIGGER_EN_SHIFT             CyUAB_TRIGGER_EN_SHIFT
#define VDAC_2_UAB_TRIGGER_EN_MASK              (1UL<<VDAC_2_UAB_TRIGGER_EN_SHIFT)

#define VDAC_2_UAB_RUN_SHIFT                    CyUAB_RUN_SHIFT
#define VDAC_2_UAB_RUN_MASK                     (1UL<<VDAC_2_UAB_RUN_SHIFT)


/*STAT*/
#define VDAC_2_UAB_CURR_STEP_SHIFT              CyUAB_CURR_STEP_SHIFT
#define VDAC_2_UAB_CURR_STEP_MASK               (0xfUL<<VDAC_2_UAB_CURR_STEP_SHIFT)

#define VDAC_2_UAB_COMP_SHIFT                   CyUAB_COMP_SHIFT
#define VDAC_2_UAB_COMP_MASK                    (1UL<<VDAC_2_UAB_COMP_SHIFT)

#define VDAC_2_UAB_CURR_SUBSAMPLE_SHIFT         CyUAB_CURR_SUBSAMPLE_SHIFT
#define VDAC_2_UAB_CURR_SUBSAMPLE_MASK          (0xffUL<<VDAC_2_UAB_CURR_SUBSAMPLE_SHIFT)


/*SRAM*/
#define VDAC_2_UAB_WAVE_STEP_SHIFT              CyUAB_WAVE_STEP_SHIFT
#define VDAC_2_UAB_WAVE_STEP_MASK               (0x0000ffffUL)


/*CAP_TRIM*/
#define VDAC_2_UAB_CBTC_VAL_SHIFT               CyUAB_CBTC_VAL_SHIFT
#define VDAC_2_UAB_CBTC_VAL_MASK                (0x7UL<<VDAC_2_UAB_CBTC_VAL_SHIFT)

#define VDAC_2_UAB_CCTC_VAL_SHIFT               CyUAB_CCTC_VAL_SHIFT
#define VDAC_2_UAB_CCTC_VAL_MASK                (0x7UL<<VDAC_2_UAB_CCTC_VAL_SHIFT)


/*OA_TRIM*/
#define VDAC_2_UAB_OA_OFFSET_SHIFT              CyUAB_OA_OFFSET_SHIFT
#define VDAC_2_UAB_OA_OFFSET_MASK               (0xfUL<<VDAC_2_UAB_OA_OFFSET_SHIFT)

#define VDAC_2_UAB_REF_OFFSET_SHIFT             CyUAB_REF_OFFSET_SHIFT
#define VDAC_2_UAB_REF_OFFSET_MASK              (0x1fUL<<VDAC_2_UAB_REF_OFFSET_SHIFT)

#define VDAC_2_UAB_AGND_OFFSET_SHIFT            CyUAB_AGND_OFFSET_SHIFT
#define VDAC_2_UAB_AGND_OFFSET_MASK             (0x1fUL<<VDAC_2_UAB_AGND_OFFSET_SHIFT)



#define VDAC_2_UAB_DAC_NEXT_MASK (CyUAB_DAC_NEXT_MASK)


#endif
